app/controllers/forests_controller.rb

SELECT "forests".* FROM "forests"
---
  def index
    @forests = Forest.all

INSERT INTO "forests" ("climate", "created_at", "latitude", "longitude", "name", "size", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["climate", "aa"], ["created_at", Wed, 09 Apr 2014 09:17:13 UTC +00:00], ["latitude", 0], ["longitude", 0], ["name", "aa"], ["size", 0], ["updated_at", Wed, 09 Apr 2014 09:17:13 UTC +00:00]]
---
  def create
    @forest = Forest.new(forest_params)

    respond_to do |format|
      if @forest.save

DELETE FROM "forests" WHERE "forests"."id" = ?  [["id", 1]]
---
  def destroy
    @forest.destroy

SELECT "forests".* FROM "forests" WHERE "forests"."id" = ? LIMIT 1  [["id", "4"]]
---
    def set_forest
      @forest = Forest.find(params[:id])